package ch02variable;

public class Var03NumType {

    public static void main(String[] args) {
        // 정수 (자바는 기본으로 int를 계산하도록 설계)
        byte b = 127; // -127 ~ 127

        short s = 32767; // -32768 ~ 32767;

        int i = 2_147_483_647; // -2³¹ ~ 2³¹-1 (-2,147,483,648 ~ 2,147,483,647) 약 21억

        long l = 9_223_372_036_854_775_807L; // -2⁶³ ~ 2⁶³-1 (-9,223,372,036,854,775,808 ~ 9,223,372,036,854,775,807)

    
        // 실수
        float f = 10.0f; // 실무에서 float를 사용하는 경우는 거의 없음 (정밀도가 낮음)
        double d = 10.0;
    }
}
